Masmiseim36/nxpSDK/boards/frdmke16z/demo_apps/mc_bldc/pin_mux.c
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MKE16Z64xxx4
package_id: MKE16Z64VLF4
mcu_data: ksdk2_0
processor_version: 0.9.1
board: FRDM-KE16Z
pin_labels:
- {pin_num: '1', pin_signal: TSI0_CH5/PTD1/FTM0_CH3/TRGMUX_OUT2, label: 'D4[3]/RGB_BLUE', identifier: LED_BLUE;FTM0_CH3}
- {pin_num: '2', pin_signal: TSI0_CH4/PTD0/FTM0_CH2/TRGMUX_OUT1, label: 'J1[12]/J3[11]/Arduino_D5/MC_PWM_BT', identifier: FTM0_CH2}
- {pin_num: '15', pin_signal: TSI0_CH9/PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0, label: 'D4[1]/RGB_RED', identifier: LED_RED;FTM0_CH5}
- {pin_num: '16', pin_signal: TSI0_CH8/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1, label: 'D4[4]/RGB_GREEN', identifier: LED_GREEN;FTM0_CH4}
- {pin_num: '22', pin_signal: ADC0_SE9/TSI0_CH23/PTC1/FTM0_CH1, label: 'J2[9]/GES_R1', identifier: FTM0_CH1}
- {pin_num: '23', pin_signal: ADC0_SE8/TSI0_CH22/PTC0/FTM0_CH0, label: 'J2[7]/GES_R0', identifier: FTM0_CH0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_trgmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    PinTool_FTM();
    PinTool_Misc();
    PinTool_LPUART();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_FTM:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '23', peripheral: FTM0, signal: 'CH, 0', pin_signal: ADC0_SE8/TSI0_CH22/PTC0/FTM0_CH0}
  - {pin_num: '22', peripheral: FTM0, signal: 'CH, 1', pin_signal: ADC0_SE9/TSI0_CH23/PTC1/FTM0_CH1}
  - {pin_num: '2', peripheral: FTM0, signal: 'CH, 2', pin_signal: TSI0_CH4/PTD0/FTM0_CH2/TRGMUX_OUT1}
  - {pin_num: '1', peripheral: FTM0, signal: 'CH, 3', pin_signal: TSI0_CH5/PTD1/FTM0_CH3/TRGMUX_OUT2, identifier: FTM0_CH3}
  - {pin_num: '16', peripheral: FTM0, signal: 'CH, 4', pin_signal: TSI0_CH8/PTB4/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1, identifier: FTM0_CH4}
  - {pin_num: '15', peripheral: FTM0, signal: 'CH, 5', pin_signal: TSI0_CH9/PTB5/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0, identifier: FTM0_CH5}
  - {peripheral: PDB0, signal: TRG, pin_signal: FTM0_Trigger}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PinTool_FTM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PinTool_FTM(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTB4 (pin 16) is configured as FTM0_CH4 */
    PORT_SetPinMux(BOARD_FTM0_CH4_PORT, BOARD_FTM0_CH4_PIN, kPORT_MuxAlt2);

    /* PORTB5 (pin 15) is configured as FTM0_CH5 */
    PORT_SetPinMux(BOARD_FTM0_CH5_PORT, BOARD_FTM0_CH5_PIN, kPORT_MuxAlt2);

    /* PORTC0 (pin 23) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_FTM0_CH0_PORT, BOARD_FTM0_CH0_PIN, kPORT_MuxAlt2);

    /* PORTC1 (pin 22) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_FTM0_CH1_PORT, BOARD_FTM0_CH1_PIN, kPORT_MuxAlt2);

    /* PORTD0 (pin 2) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_FTM0_CH2_PORT, BOARD_FTM0_CH2_PIN, kPORT_MuxAlt2);

    /* PORTD1 (pin 1) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_FTM0_CH3_PORT, BOARD_FTM0_CH3_PIN, kPORT_MuxAlt2);
    /* FTM0 is selected as PDB0 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX0, kTRGMUX_Pdb0, kTRGMUX_TriggerInput0, kTRGMUX_SourceFtm0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_Misc:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '33', peripheral: GPIOD, signal: 'GPIO, 3', pin_signal: PTD3/NMI_b, direction: INPUT, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PinTool_Misc
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PinTool_Misc(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 33)  */
    GPIO_PinInit(BOARD_SW2_GPIO, BOARD_SW2_PIN, &SW2_config);

    /* PORTD3 (pin 33) is configured as PTD3 */
    PORT_SetPinMux(BOARD_SW2_PORT, BOARD_SW2_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[3] = ((PORTD->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
PinTool_LPUART:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '26', peripheral: LPUART0, signal: TX, pin_signal: ADC0_SE5/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0}
  - {pin_num: '27', peripheral: LPUART0, signal: RX, pin_signal: ADC0_SE4/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : PinTool_LPUART
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void PinTool_LPUART(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked. */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* PORTB0 (pin 27) is configured as LPUART0_RX */
    PORT_SetPinMux(BOARD_DEBUG_UART_RX_PORT, BOARD_DEBUG_UART_RX_PIN, kPORT_MuxAlt2);

    /* PORTB1 (pin 26) is configured as LPUART0_TX */
    PORT_SetPinMux(BOARD_DEBUG_UART_TX_PORT, BOARD_DEBUG_UART_TX_PIN, kPORT_MuxAlt2);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
